In [2]:
import pandas as pd

### 1. Review of pandas DataFrames

In [77]:
df = pd.read_csv('datasets/world_ind_pop_data.csv')

In [36]:
df.head()

,CountryName,CountryCode,Year,Total Population,Urban population (% of total)
0,Arab World,ARB,1960,9.249590e+07,31.285384
1,Caribbean small states,CSS,1960,4.190810e+06,31.597490
2,Central Europe and the Baltics,CEB,1960,9.140158e+07,44.507921
3,East Asia & Pacific (all income levels),EAS,1960,1.042475e+09,22.471132
4,East Asia & Pacific (developing only),EAP,1960,8.964930e+08,16.917679

In [34]:
df.tail()

,CountryName,CountryCode,Year,Total Population,Urban population (% of total)
13369,Virgin Islands (U.S.),VIR,2014,104170.0,95.203
13370,West Bank and Gaza,WBG,2014,4294682.0,75.026
13371,"Yemen, Rep.",YEM,2014,26183676.0,34.027
13372,Zambia,ZMB,2014,15721343.0,40.472
13373,Zimbabwe,ZWE,2014,15245855.0,32.501

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13374 entries, 0 to 13373
Data columns (total 5 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   CountryName                    13374 non-null  object
 1   CountryCode                    13374 non-null  object
 2   Year                           13374 non-null  int64
 3   Total Population               13374 non-null  float64
 4   Urban population (% of total)  13374 non-null  float64
dtypes: float64(2), int64(1), object(2)
memory usage: 522.5+ KB

In [79]:
import pandas as pd
df = pd.read_csv('datasets/world_ind_pop_data.csv')
# df is already manipulated, only original dataset available for download
df.iloc[0:10380:3, -2] = np.nan
# Above statement makes dataset similar to one DataCamp gives you on console
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13374 entries, 0 to 13373
Data columns (total 5 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   CountryName                    13374 non-null  object
 1   CountryCode                    13374 non-null  object
 2   Year                           13374 non-null  int64
 3   Total Population               9914 non-null   float64
 4   Urban population (% of total)  13374 non-null  float64
dtypes: float64(2), int64(1), object(2)
memory usage: 522.5+ KB

In [100]:
# Import numpy
import numpy as np
import pandas as pd
df = pd.read_csv('datasets/world_population.csv')

In [102]:
# Create array of DataFrame values: np_vals
np_vals = df.values

In [103]:
np_vals

array([[1.96000000e+03, 3.03497056e+09],
       [1.97000000e+03, 3.68482270e+09],
       [1.98000000e+03, 4.43659036e+09],
       [1.99000000e+03, 5.28271599e+09],
       [2.00000000e+03, 6.11597449e+09],
       [2.01000000e+03, 6.92428294e+09]])

In [105]:
# Create new array of base 10 logarithm values: np_vals_log10
np_vals_log10 = np.log10(np_vals)

In [106]:
np_vals_log10

array([[3.29225607, 9.48215448],
       [3.29446623, 9.5664166 ],
       [3.29666519, 9.64704933],
       [3.29885308, 9.72285726],
       [3.30103   , 9.78646566],
       [3.30319606, 9.84037481]])

In [107]:
# Print original and new data containers
[print(x, 'has type', type(eval(x))) for x in ['np_vals', 'np_vals_log10', 'df', 'df_log10']]

np_vals has type <class 'numpy.ndarray'>
np_vals_log10 has type <class 'numpy.ndarray'>
df has type <class 'pandas.core.frame.DataFrame'>
df_log10 has type <class 'pandas.core.frame.DataFrame'>

[None, None, None, None]

In [99]:
#Final Code
    
    # Import numpy
    import numpy as np
    import pandas as pd

    df = pd.read_csv('datasets/world_population.csv')

    # Create array of DataFrame values: np_vals
    np_vals = df.values

    # Create new array of base 10 logarithm values: np_vals_log10
    np_vals_log10 = np.log10(np_vals)

    # Create array of new DataFrame by passing df to np.log10(): df_log10
    df_log10 = np.log10(df)

    # Print original and new data containers
    [print(x, 'has type', type(eval(x))) for x in ['np_vals', 'np_vals_log10', 'df', 'df_log10']]

np_vals has type <class 'numpy.ndarray'>
np_vals_log10 has type <class 'numpy.ndarray'>
df has type <class 'pandas.core.frame.DataFrame'>
df_log10 has type <class 'pandas.core.frame.DataFrame'>

[None, None, None, None]

### 2. Building DataFrames from scratch

In [5]:
import pandas as  pd

In [8]:
data = {
    'weekday' : ['Sun','Sun','Mon',  'Mon'],
    'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
    'visitors': [139, 237, 326, 456],
    'signups': [7, 12, 3, 5]
}
users = pd.DataFrame(data)

In [9]:
users

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [35]:
weekdays =  ['Sun', 'Sun','Mon',  'Mon']
cities = ['Austin', 'Dallas', 'Austin', 'Dallas']
visitors = [139, 237, 326, 456]
signups = [7, 12, 3, 5]

list_labels = ['city', 'signups', 'visitors', 'weekday']
list_cols = [cities, signups, visitors, weekdays]

zipped = list(zip(list_labels, list_cols))
zipped

[('city', ['Austin', 'Dallas', 'Austin', 'Dallas']),
 ('signups', [7, 12, 3, 5]),
 ('visitors', [139, 237, 326, 456]),
 ('weekday', ['Sun', 'Sun', 'Mon', 'Mon'])]

In [36]:
data = dict(zipped)

In [32]:
data

{'city': (['Austin', 'Dallas', 'Austin', 'Dallas'],),
 'signups': [7, 12, 3, 5],
 'visitors': ([139, 237, 326, 456],),
 'weekday': (['Sun', 'Sun', 'Mon', 'Mon'],)}

In [38]:
users = pd.DataFrame(data)

In [39]:
users

     city  signups  visitors weekday
0  Austin        7       139     Sun
1  Dallas       12       237     Sun
2  Austin        3       326     Mon
3  Dallas        5       456     Mon

In [42]:
# broadcasting to entire column
users['fees'] = 0
users

     city  signups  visitors weekday  fees
0  Austin        7       139     Sun     0
1  Dallas       12       237     Sun     0
2  Austin        3       326     Mon     0
3  Dallas        5       456     Mon     0

In [45]:
heights = [59.0, 65.2, 62.9, 65.4, 63.7, 65.7, 64.1]
data = {'height': heights, 'sex' : 'M'}
results = pd.DataFrame(data)
results.columns = ['Height(in)', 'Sex']
results.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
results

   Height(in) Sex
A        59.0   M
B        65.2   M
C        62.9   M
D        65.4   M
E        63.7   M
F        65.7   M
G        64.1   M

### Zip lists to build a DataFrame

In [46]:
list_keys = ['Country', 'Total']
list_values = [['United States', 'Soviet Union', 'United Kingdom'], [1118, 473, 273]]

In [47]:
zipped = list(zip(list_keys, list_values))  # tuples
zipped

[('Country', ['United States', 'Soviet Union', 'United Kingdom']),
 ('Total', [1118, 473, 273])]

In [48]:
data  = dict(zipped)

In [49]:
data

{'Country': ['United States', 'Soviet Union', 'United Kingdom'],
 'Total': [1118, 473, 273]}

In [52]:
df = pd.DataFrame.from_dict(data)

In [53]:
df

          Country  Total
0   United States   1118
1    Soviet Union    473
2  United Kingdom    273

### Labeling your data

In [56]:
import numpy as np
billboard_values = np.array([['1980', 'Blondie', 'Call Me', '6'],
                             ['1981', 'Chistorpher Cross', 'Arthurs Theme', '3'],
                             ['1982', 'Joan Jett', 'I Love Rock and Roll', '7']]).transpose()
billboard_keys = ['a', 'b', 'c', 'd']

billboard_zipped = list(zip(billboard_keys, billboard_values))
billboard_zipped

[('a', array(['1980', '1981', '1982'], dtype='<U20')),
 ('b', array(['Blondie', 'Chistorpher Cross', 'Joan Jett'], dtype='<U20')),
 ('c',
  array(['Call Me', 'Arthurs Theme', 'I Love Rock and Roll'], dtype='<U20')),
 ('d', array(['6', '3', '7'], dtype='<U20'))]

In [57]:
billboard_dict = dict(billboard_zipped)
billboard_dict

{'a': array(['1980', '1981', '1982'], dtype='<U20'),
 'b': array(['Blondie', 'Chistorpher Cross', 'Joan Jett'], dtype='<U20'),
 'c': array(['Call Me', 'Arthurs Theme', 'I Love Rock and Roll'], dtype='<U20'),
 'd': array(['6', '3', '7'], dtype='<U20')}

In [58]:
df = pd.DataFrame.from_dict(billboard_dict)
df

      a                  b                     c  d
0  1980            Blondie               Call Me  6
1  1981  Chistorpher Cross         Arthurs Theme  3
2  1982          Joan Jett  I Love Rock and Roll  7

In [59]:
# Build a list of labels: list_labels
list_labels = ['year', 'artist', 'song', 'chart weeks']
df.columns = list_labels
df

   year             artist                  song chart weeks
0  1980            Blondie               Call Me           6
1  1981  Chistorpher Cross         Arthurs Theme           3
2  1982          Joan Jett  I Love Rock and Roll           7

### Building DataFrames with broadcasting

In [61]:
# preset

cities =  ['Manheim', 'Preston park', 'Biglerville', 'Indiana', 'Curwensville', 'Crown', 'Harveys lake', 'Mineral springs', 'Cassville', 'Hannastown', 'Saltsburg', 'Tunkhannock', 'Pittsburgh', 'Lemasters', 'Great bend']

# Make a string with the value 'PA': state
state = 'PA'

# Construct a dictionary: data
data = {'state':state, 'city':cities}

# Construct a DataFrame from dictionary data: df
df = pd.DataFrame(data)

# Print the DataFrame
print(df)